#### Terraform working directory 🏠: `demo/demo-account/network/security-group`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.security-group.module.sgs["sgMgmt"].aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "sgMgmt"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sgMgmt"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "sgMgmt"
        }
      + tags_all               = {
          + "Name" = "sgMgmt"
        }
      + vpc_id                 = "vpc-0c0c925bacfdab0d1"
    }

  # module.security-group.module.sgs["sgZabbixDB"].aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "sgZabbixDB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sgZabbixDB"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "sgZabbixDB"
        }
      + tags_all               = {
          + "Name" = "sgZabbixDB"
        }
      + vpc_id                 = "vpc-0c0c925bacfdab0d1"
    }

  # module.security-group.module.sg_rules["sgMgmt"].module.egress["allow-outbound"].aws_security_group_rule.cidr["0.0.0.0/0_-1_-1_-1"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.security-group.module.sg_rules["sgMgmt"].module.ingress["mgmt-access"].aws_security_group_rule.cidr["10.0.0.0/16_tcp_22_22"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow jumphost ssh"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.security-group.module.sg_rules["sgMgmt"].module.ingress["mgmt-access"].aws_security_group_rule.cidr["10.0.0.0/16_tcp_3389_3389"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow jumphost rdp"
      + from_port                = 3389
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3389
      + type                     = "ingress"
    }

  # module.security-group.module.sg_rules["sgZabbixAgent"].module.egress["to-zabbix-server"].aws_security_group_rule.sg["sgZabbixServer_tcp_10051_10051"] must be replaced
-/+ resource "aws_security_group_rule" "sg" {
      ~ id                       = "sgrule-3380570534" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0d51e89f9030a72f3" -> (known after apply)
      ~ source_security_group_id = "sg-084d3489f1283aa71" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.security-group.module.sg_rules["sgZabbixAgent"].module.ingress["zabbix-server-inbound"].aws_security_group_rule.sg["sgZabbixServer_tcp_10050_10050"] must be replaced
-/+ resource "aws_security_group_rule" "sg" {
      ~ id                       = "sgrule-3495353295" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0aab8fa0737e3878c" -> (known after apply)
      ~ source_security_group_id = "sg-084d3489f1283aa71" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.security-group.module.sg_rules["sgZabbixDB"].module.egress["allow-outbound"].aws_security_group_rule.cidr["0.0.0.0/0_-1_-1_-1"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.security-group.module.sg_rules["sgZabbixDB"].module.ingress["zabbix-server-inbound"].aws_security_group_rule.sg["sgZabbixServer_tcp_3306_3306"] will be created
  + resource "aws_security_group_rule" "sg" {
      + description              = "Allow MYSQL/Aurora"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.security-group.module.sg_rules["sgZabbixServer"].module.ingress["zabbix-agent-inbound"].aws_security_group_rule.sg["sgZabbixAgent_tcp_10051_10051"] must be replaced
-/+ resource "aws_security_group_rule" "sg" {
      ~ id                       = "sgrule-2059919417" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0c6cd906fc7b83206" -> (known after apply)
      ~ source_security_group_id = "sg-02fe35293d62c11f1" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 10 to add, 0 to change, 3 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
